consumer_resistance = 0.03
fourth_part = """
При производстве УР используется сырье, материалы, комплектующие, прошедшие входной
контроль:
- для трубопроводов – стальные трубы и фасонные изделия (переходы, фланцы, отводы,
тройники);
- в качестве запорной арматуры – краны шаровые, затворы;
- в качестве обратной арматуры – клапана обратные;
- в качестве предохранительной арматуры – клапана предохранительные;
- для контроля давления и температуры в системе – манометры, термометры,
термоманометры;
- в качестве электрического оборудования – электропривод для регулирующего устройства,
насосное оборудование.
Поверхность трубопроводов очищается в пескоструйной камере абразивной струйной очисткой
сжатым воздухом, обезжиривается и окрашивается на покрасочной линии методом
электростатического распыления порошковой полиэфирной краской. По требованию заказчика
трубопроводы готового изделия изолируются тепловой изоляцией.
Для герметизации и фиксации резьбовых соединений используется анаэробный резьбовой
герметик, лента ФУМ, для уплотнения фланцевых соединений применяются паронитовые
прокладки со смазкой «Циатим».
При изготовлении УР осуществляется контроль качества на различных стадиях производства:
входной контроль, контроль качества очистки от поверхностной ржавчины, контроль качества
сварных соединений, контроль качества лакокрасочного покрытия, контроль качества сборки,
гидравлические испытания изделия на герметичность.
Для обеспечения защиты изделий от воздействия механических и климатических факторов при
транспортировании и хранении УР упаковываются вначале в полимерный оберточный материал,
затем в деревянную тару (обрешетку, ящик). В тару вкладывается комплект сопроводительной и
эксплуатационной документации в пакете из водонепроницаемого материала.
Производится контроль сварочного шва. Технологическое оборудование прошло поверку.
Гидравлические испытания проводятся давлением, равным 1,25 рабочего давления.
УР "Вектор" сертифицирован в системе добровольной сертификации и соответствует
требованиям ТУ BY 810000679.041-2014, ГОСТ 12.2.003.
С целью постоянного совершенствования оборудования производитель оставляет за
собой право изменять комплектацию и технические характеристики изделия, не влияющие
на выполняемые им основные функции, без предварительного согласия заказчика.
"""
sixth_part = """
Условия транспортировки в части воздействия климатических факторов должны
соответствовать условиям хранения 3 по ГОСТ 15150. Транспортировать изделия в упаковке
предприятия-изготовителя в закрытом транспорте с естественной вентиляцией при температуре
воздуха от -10 ºС до +50 ºС.
Условия транспортировки в части воздействия механических факторов должны
соответствовать условиям С по ГОСТ 23216.
"""
seventh_part = """
1. Узел регулирующий (УР).
2. Паспорт, руководство по эксплуатации.
"""
eighth_part = """
Обрешетка.
"""
fifth_part = """
Условия хранения в части воздействия климатических факторов должны соответствовать
условиям хранения 1 по ГОСТ 15150. При хранении изделия должны быть защищены отатмосферных осадков, солнечных лучей, механических повреждений и деформаций.
Срок хранения 12 месяцев в сухом вентилируемом помещении при температуре от +5ºС до +40
ºС, относительной влажности до 80 % при температуре +25 ºС и до 50 % при температуре +40 ºС.
"""
pure_water = """
Вода, соответствует требованиям
СП 124.13330.2012
"""
acceptor = """Мартыненко А.М."""