import os 
import pandas as pd
from docx import Document
from re import findall as f_all
import streamlit as st
import io

def temps(valve:str, keyword): # Определяет температурные диапазоны для ВЕКТОРа
    match valve:
            case "С":
                temperatures = {"3": "0...+50 °C", "1": "+5...+150 °C","2": "+5...+150 °C", "4": "+5...+120 °C", "4М": "+5...+150 °C", "5": "+5...+120 °C", "5М": "+5...+120 °C", "6": "+5...+120 °C", "6М": "+5...+120 °C"}
            case "Ш":
                temperatures = {"2": "+5...+120 °C", "4": "+5...+120 °C", "4М": "+5...+150 °C", "5": "+5...+120 °C", "5М": "+5...+120 °C", "6": "+5...+120 °C", "6М": "+5...+120 °C"}
    return temperatures[keyword]

def dP(V, Kvs): # Простенькая функция, определяющая перепад давления на клапане
    return 100 * ((V/Kvs)**2)

def super_mega_giga(vector): # Выводит данные из огромной таблицы с составляющими регулирующего узла
    info = {'1-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КПСР 2.11-15-4,0-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '1-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КПСР 2.11-50-40-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-1-С-9': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 1.0}, '2-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КПСР 2.11-15-4,0-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS40-120F/250', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS50-120F/280', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS50-120F/280', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КПСР 2.11-50-40-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.040.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS65-100F/340', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-9': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-10': {0: 'Клапан балансировочный чугунный фл-фл Ду100 Lмонт.-350мм', 1: 'Клапан КПСР 2.17-65-63-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.050.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'TOP-S 80/10\n', 7: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-10': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-С-11': {0: 'Клапан балансировочный чугунный Фл-Фл Ду125 Lмонт.-400мм', 1: 'Клапан КПСР 2.17-80-100-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.065.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'TOP-S 80/15', 7: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-2-С-11': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '2-Ш-1А': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Кран VRG131 15-0,4 арт. 11600100', 3: 'Кран шаровой латунный 15.В-Н.Б арт. VF.218.LB1.012', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Насос FPS25-40/180\nНасос FPS25-40/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 8: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-2-Ш-1А': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 3.0, 7: 1.0, 8: 1.0}, '2-Ш-1Б': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Кран VRG131 15-0,63 арт. 11600200', 3: 'Кран шаровой латунный 15.В-Н.Б арт. VF.218.LB1.012', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Насос FPS25-40/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 8: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-2-Ш-1Б': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 3.0, 7: 1.0, 8: 1.0}, '2-Ш-1': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 3: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-2-Ш-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-2-Ш-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 3: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-2-Ш-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-2-Ш-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-2-Ш-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-2-Ш-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '2-Ш-7': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 2: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 3: 'Кран шаровой латунный G1 1/2 В-В.Р арт. VF.214.LR1.112', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос FPS40-160F/250', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 1/2 арт. VT.192.N.08'}, 'К-2-Ш-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 3.0, 7: 1.0}, '2-Ш-8': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 2: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410', 3: 'Кран шаровой латунный G2 В-В.Р арт. VF.214.LR1.200', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос FPS50-120F/280', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G2 арт. VT.192.N.09'}, 'К-2-Ш-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 3.0, 7: 1.0}, '3-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW500-XD24-S.12'}, 'К-3-С-9': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-10': {0: 'Клапан балансировочный чугунный фл-фл Ду100 Lмонт.-350мм', 1: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW3000-XD24-S.12'}, 'К-3-С-10': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '3-С-11': {0: 'Клапан балансировочный чугунный Фл-Фл Ду125 Lмонт.-400мм', 1: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой для манометра (G1/2-М20х1,5) Б арт. ZW10024', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 6: 'Электропривод TW3000-XD24-S.12'}, 'К-3-С-11': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 1.0}, '4М-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS25-60/180', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 4.0, 5: 1.0, 6: 3.0, 7: 1.0, 8: 1.0}, '4М-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4М-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4М-С-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4М-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4М-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду15 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS25-60/180', 8: 'Термоманометр ТМТБ-31 Р.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-6': {0: 1, 1: 1, 2: 1, 3: 2, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4М-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду20 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS50-120F/280', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-7': {0: 1, 1: 1, 2: 1, 3: 2, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4М-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой Ду20 муфт. ВН-ВН (Ру 1.6 МПа, t -50…+150°C)', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS50-120F/280', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-8': {0: 1, 1: 1, 2: 1, 3: 2, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4М-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.040.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный 32.В-В.Р арт. LD 47.301.32', 4: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS65-100F/340', 8: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4М-С-9': {0: 1, 1: 1, 2: 1, 3: 2, 4: 2, 5: 1, 6: 1, 7: 1, 8: 3, 9: 1, 10: 1}, '4М-С-10': {0: 'Клапан балансировочный чугунный фл-фл Ду100 Lмонт.-350мм', 1: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.050.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный 32.В-В.Р арт. LD 47.301.32', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'TOP-S 80/10', 8: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW3000-XD24-S.12'}, 'К-4М-С-10': {0: 1, 1: 1, 2: 1, 3: 2, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4М-С-11': {0: 'Клапан балансировочный чугунный Фл-Фл Ду125 Lмонт.-400мм', 1: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.065.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный 32.В-В.Р арт. LD 47.301.32', 4: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'TOP-S 80/15', 8: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW3000-XD24-S.12'}, 'К-4М-С-11': {0: 1, 1: 1, 2: 1, 3: 2, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Насос FPS25-60/180', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 9: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0, 9: 1.0}, '4-С-4': {0: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS32-80/180\n', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 3.0, 7: 1.0, 8: 1.0}, '4-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS32-80/180', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-5': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS25-60/180', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-6': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS50-120F/280', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-7': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS50-120F/280', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-8': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.040.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'Насос FPS65-100F/340', 8: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW500-XD24-S.12'}, 'К-4-С-9': {0: 1, 1: 1, 2: 1, 3: 1, 4: 2, 5: 1, 6: 1, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-10': {0: 'Клапан балансировочный чугунный фл-фл Ду100 Lмонт.-350мм', 1: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.050.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'TOP-S 80/10', 8: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW3000-XD24-S.12'}, 'К-4-С-10': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-С-11': {0: 'Клапан балансировочный чугунный Фл-Фл Ду125 Lмонт.-400мм', 1: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У', 2: 'Клапан обратный CVS16.05.065.16 ТУ 3700-005-81673229-2009', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Кран шаровой фланцевый КШ.Ц.Ф.080/070.016.Н/П.02 ТУ 3742-001-45630744-2003', 6: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 7: 'TOP-S 80/15', 8: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 9: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 10: 'Электропривод TW3000-XD24-S.12'}, 'К-4-С-11': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 3, 9: 1, 10: 1}, '4-Ш-1А': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Кран VRG131 15-0,4 арт. 11600100', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Насос FPS25-40/180', 5: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 7: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-4-Ш-1А': {0: 1.0, 1: 1.0, 2: 1.0, 3: 4.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '4-Ш-1Б': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Кран VRG131 15-0,63 арт. 11600200', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Насос FPS25-40/180', 5: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 7: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-4-Ш-1Б': {0: 1.0, 1: 1.0, 2: 1.0, 3: 4.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '4-Ш-1': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос FPS25-60/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-4-Ш-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 3.0, 7: 1.0}, '4-Ш-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос FPS25-60/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-4-Ш-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 3.0, 7: 1.0}, '4-Ш-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос FPS25-60/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-4-Ш-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0, 6: 3.0, 7: 1.0}, '4-Ш-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 20 арт. VF.227.LB1.034', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-4-Ш-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0}, '4-Ш-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 20 арт. VF.227.LB1.034', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-4-Ш-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0}, '4-Ш-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 2: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 20 арт. VF.227.LB1.034', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS32-80/180', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-4-Ш-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 2.0, 6: 1.0, 7: 3.0, 8: 1.0}, '4-Ш-7': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 2: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 3: 'Кран шаровой латунный G1 1/2 В-В.Р арт. VF.214.LR1.112', 4: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 5: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 6: 'Насос FPS40-160F/250', 7: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G1 1/2 арт. VT.192.N.08'}, 'К-4-Ш-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '4-Ш-8': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 2: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410', 3: 'Кран шаровой латунный G2 В-В.Р арт. VF.214.LR1.200', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 6: 'Насос FPS50-120F/280', 7: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 8: 'Фильтр сетчатый муфтовый G2 арт. VT.192.N.09'}, 'К-4-Ш-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 1.0, 7: 3.0, 8: 1.0}, '5М-С-1': {0: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-2': {0: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-3': {0: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-4': {0: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.015.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.015.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS32-80/180', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-5': {0: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS32-80/180', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-6': {0: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS40-120F/250', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-7': {0: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS50-120F/280', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-8': {0: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.040.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS50-120F/280', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-9': {0: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.050.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'Насос FPS65-120F/340', 6: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW500-XD24-S.12'}, 'К-5М-С-9': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-10': {0: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.065.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'TOP-S 80/10', 6: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW3000-XD24-S.12'}, 'К-5М-С-10': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-С-11': {0: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У', 1: 'Клапан обратный CVS16.05.080.16 ТУ 3700-005-81673229-2009', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.080/070.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 5: 'TOP-S 80/15', 6: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 8: 'Электропривод TW3000-XD24-S.12'}, 'К-5М-С-11': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 2.0, 5: 1.0, 6: 4.0, 7: 1.0, 8: 1.0}, '5М-Ш-1А': {0: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 1: 'Кран VRG131 15-0,4 арт. 11600100', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Насос LRS 25/8-180G', 5: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 7: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-5М-Ш-1А': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 4.0, 6: 1.0, 7: 1.0}, '5М-Ш-1Б': {0: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 1: 'Кран VRG131 15-0,63 арт. 11600200', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Насос LRS 25/8-180G', 5: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 7: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-5М-Ш-1Б': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 4.0, 6: 1.0, 7: 1.0}, '5М-Ш-1': {0: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5М-Ш-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-2': {0: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 2: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5М-Ш-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-3': {0: 'Клапан обратный муфтовый G1/2 арт. VT.151.N.04', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 2: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 3: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 4: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 5: 'Насос LRS 25/8-180G', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5М-Ш-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-4': {0: 'Клапан обратный муфтовый G3/4 арт. VT.151.N.05', 1: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой латунный с американкой 20 арт. VF.227.LB1.034', 4: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 5: 'Насос FPS32-80/180\n', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5М-Ш-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-5': {0: 'Клапан обратный муфтовый G3/4 арт. VT.151.N.05', 1: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой латунный с американкой 20 арт. VF.227.LB1.034', 4: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 5: 'Насос FPS32-80/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5М-Ш-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-6': {0: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 1: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 4: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 5: 'Насос FPS32-80/180', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5М-Ш-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-7': {0: 'Клапан обратный муфтовый G1 арт. VT.151.N.06', 1: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 2: 'Кран шаровой латунный 25.В-Н.Б арт. VF.218.LB1.100', 3: 'Кран шаровой латунный 40.В-Н.Р арт. VF.215.LR1.112', 4: 'Кран шаровой латунный G1 1/2 В-В.Р арт. VF.214.LR1.112', 5: 'Насос FPS40-160F/250', 6: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 7: 'Фильтр сетчатый муфтовый G1 1/2 арт. VT.192.N.08'}, 'К-5М-Ш-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 1.0, 5: 1.0, 6: 4.0, 7: 1.0}, '5М-Ш-8': {0: 'Клапан обратный муфтовый G1 1/4 арт. VT.151.N.07', 1: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410', 2: 'Кран шаровой латунный 32.В-Н.Р арт. VF.215.LR1.114', 3: 'Кран шаровой латунный G2 В-В.Р арт. VF.214.LR1.200', 4: 'Насос FPS50-120F/280', 5: 'Термоманометр ТМТБ-31 Т.2 (0-150 °C) (0-1,6 МПа) G1/2.2,5', 6: 'Фильтр сетчатый муфтовый G2 арт. VT.192.N.09'}, 'К-5М-Ш-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 4.0, 6: 1.0}, '5-С-1': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос LRS 25/8-180G', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду20 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-1': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос LRS 25/8-180G', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос LRS 25/8-180G', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду25 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос FPS32-80/180', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос FPS32-80/180', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду32 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1/2 В-В.Б арт. VF.217.LB1.012', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос FPS40-120F/250', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду40 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-6': {0: 1.0, 1: 1.0, 2: 2.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-7': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос FPS50-120F/280', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду50 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-8': {0: 'Клапан балансировочный чугунный Фл-Фл Ду65 Lмонт.-290мм', 1: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'Насос FPS50-120F/280', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду65 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-9': {0: 'Клапан балансировочный чугунный фл-фл Ду80 Lмонт.-310мм', 1: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой стальной Ф-Ф 80 ОТВх8 ТУ 3742-001-45630744-2003', 4: 'Насос FPS65-120F/340', 5: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду80 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW500-XD24-S.12'}, 'К-5-С-9': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-10': {0: 'Клапан балансировочный чугунный фл-фл Ду100 Lмонт.-350мм', 1: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.100/080.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'TOP-S 80/10', 5: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду100 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW3000-XD24-S.12'}, 'К-5-С-10': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-С-11': {0: 'Клапан балансировочный чугунный Фл-Фл Ду125 Lмонт.-400мм', 1: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У', 2: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 3: 'Кран шаровой фланцевый КШ.Ц.Ф.125/100.016.Н/П.02 ТУ 3742-001-45630744-2003', 4: 'TOP-S 80/15', 5: 'Термоманометр ТМТБ-31 Р.3 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 6: 'Фильтр сетчатый IS16 Ду125 ТУ 3700-022-81673229-2009', 7: 'Электропривод TW3000-XD24-S.12'}, 'К-5-С-11': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 1.0, 5: 3.0, 6: 1.0, 7: 1.0}, '5-Ш-1А': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Кран VRG131 15-0,4 арт. 11600100', 2: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 3: 'Насос LRS 25/8-180G', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 6: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-5-Ш-1А': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0, 6: 1.0}, '5-Ш-1Б': {0: 'Клапан балансировочный муфтовый HB-13102 G1/2', 1: 'Кран VRG131 15-0,63 арт. 11600200', 2: 'Кран шаровой латунный с американкой 15 арт. VF.227.LB1.012', 3: 'Насос LRS 25/8-180G', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1/2 арт. VF.192.L00.012', 6: 'Электропривод ARA659 Uпит-24В арт. 12520200'}, 'К-5-Ш-1Б': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0, 6: 1.0}, '5-Ш-1': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 3: 'Насос LRS 25/8-180G', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5-Ш-1': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-2': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 2: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 3: 'Насос LRS 25/8-180G', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5-Ш-2': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-3': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 2: 'Кран шаровой латунный с американкой 25 арт. VF.227.LB1.100', 3: 'Насос LRS 25/8-180G', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-5-Ш-3': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-4': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 2: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 3: 'Насос FPS32-80/180\nНасос FPS32-80/180\n', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5-Ш-4': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-5': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 2: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 3: 'Насос FPS32-80/180', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5-Ш-5': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 2: 'Кран шаровой латунный с американкой 32 арт. VF.227.LB1.114', 3: 'Насос FPS32-80/180', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-5-Ш-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-7': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 2: 'Кран шаровой латунный G1 1/2 В-В.Р арт. VF.214.LR1.112', 3: 'Насос FPS40-160F/250', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/2 арт. VT.192.N.08'}, 'К-5-Ш-7': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0}, '5-Ш-8': {0: 'Клапан балансировочный муфтовый HB-13102 G2', 1: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410', 2: 'Кран шаровой латунный G2 В-В.Р арт. VF.214.LR1.200', 3: 'Насос FPS50-120F/280', 4: 'Термоманометр ТМТБ-31 Р.2 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G2 арт. VT.192.N.09'}, 'К-5-Ш-8': {0: 1.0, 1: 1.0, 2: 2.0, 3: 1.0, 4: 3.0, 5: 1.0}, '6-Ш-4': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан регулирующий AR230-2-S K3 DN20 Kvs4 арт. 3204P02303P', 2: 'Клапан ручной угловой 1/2 арт. VT.007.LN.04', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G3/4 арт. VF.192.L00.034'}, 'К-6-Ш-4': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0}, '6-Ш-5': {0: 'Клапан балансировочный муфтовый HB-13102 G3/4', 1: 'Клапан регулирующий AR230-2-S K3 DN20 Kvs6,3 арт. 3206P32303P', 2: 'Клапан ручной угловой 1/2 арт. VT.007.LN.04', 3: 'Кран шаровой латунный G3/4 В-В.Б арт. VF.217.LB1.034', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G3/4 арт. VF.192.L00.034'}, 'К-6-Ш-5': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0}, '6-Ш-6': {0: 'Клапан балансировочный муфтовый HB-13102 G1', 1: 'Клапан регулирующий AR230-4-S K3 DN25 Kvs10 арт. 32510P2303P', 2: 'Клапан ручной угловой 1/2 арт. VT.007.LN.04', 3: 'Кран шаровой латунный G1 В-В.Б арт. VF.217.LB1.100', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 арт. VF.192.L00.100'}, 'К-6-Ш-6': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0}, '6-Ш-7': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/4', 1: 'Клапан регулирующий AR230-4-S K3 DN25 Kvs16 арт. 32516P2303P', 2: 'Клапан ручной угловой 1/2 арт. VT.007.LN.04', 3: 'Кран шаровой латунный G1 1/4 В-В.Р арт. VF.214.LR1.114', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/4 арт. ZW40014'}, 'К-6-Ш-7': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0}, '6-Ш-8': {0: 'Клапан балансировочный муфтовый HB-13102 G1 1/2', 1: 'Клапан регулирующий AR230-8-S K3 DN32 Kvs25 арт. 33225P2303P', 2: 'Клапан ручной угловой 1/2 арт. VT.007.LN.04', 3: 'Кран шаровой латунный G1 1/2 В-В.Р арт. VF.214.LR1.112', 4: 'Термоманометр ТМТБ-31 Т.1 (0-150 °C) (0-1,6 МПа) G 1/2 2,5', 5: 'Фильтр сетчатый муфтовый G1 1/2 арт. VT.192.N.08'}, 'К-6-Ш-8': {0: 1.0, 1: 1.0, 2: 1.0, 3: 2.0, 4: 2.0, 5: 1.0}}
    compl = [info["-".join(vector.split("-")[1:4])], info[f'К-{"-".join(vector.split("-")[1:4])}']]
    elems, quantities = [compl[0][i] for i in compl[0].keys()], [int(compl[1][i]) for i in compl[1].keys()]
    return [elems, quantities]

def valve_recognition(real_G, vector): # Функция, определяющая корректный регулировочный клапан по его Квс
    valves = {'1-С': {1: 'Клапан КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КПСР 2.11-15-4,0-0-СЧ-1,6-1-150-У', 5: 'Клапан КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КПСР 2.11-50-40-0-СЧ-1,6-1-150-У'}, '2-С': {1: 'Клапан КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КПСР 2.11-15-4,0-0-СЧ-1,6-1-150-У', 5: 'Клапан КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КПСР 2.11-50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КПСР 2.17-65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КПСР 2.17-80-100-0-СЧ-1,6-1-150-У'}, '3-С': {1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 5: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У'}, '4-С': {1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 5: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У'}, '4М-С': {1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 5: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У'}, '5-С': {1: 'Клапан КССР 15-1-0-СЧ-1,6-1-150-У', 2: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 5: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У'}, '5М-С': {1: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 2: 'Клапан КССР 15-1,6-0-СЧ-1,6-1-150-У', 3: 'Клапан КССР 15-2,5-0-СЧ-1,6-1-150-У', 4: 'Клапан КССР 15-4-0-СЧ-1,6-1-150-У', 5: 'Клапан КССР 20-6,3-0-СЧ-1,6-1-150-У', 6: 'Клапан КССР 25-10-0-СЧ-1,6-1-150-У', 7: 'Клапан КССР 32-16-0-СЧ-1,6-1-150-У', 8: 'Клапан КССР 40-25-0-СЧ-1,6-1-150-У', 9: 'Клапан КССР 50-40-0-СЧ-1,6-1-150-У', 10: 'Клапан КССР 65-63-0-СЧ-1,6-1-150-У', 11: 'Клапан КССР 80-100-0-СЧ-1,6-1-150-У'},

    '2-Ш': {"1А":"Кран VRG131 15-0,4 арт. 11600100","1Б":"Кран VRG131 15-0,63 арт. 11600200",1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 4: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 5: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 6: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 7: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 8: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410'}, '4-Ш': {"1А":"Кран VRG131 15-0,4 арт. 11600100","1Б":"Кран VRG131 15-0,63 арт. 11600200",1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 4: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 5: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 6: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 7: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 8: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410'}, '5-Ш': {"1А":"Кран VRG131 15-0,4 арт. 11600100","1Б":"Кран VRG131 15-0,63 арт. 11600200",1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 4: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 5: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 6: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 7: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 8: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410'}, '5М-Ш': {"1А":"Кран VRG131 15-0,4 арт. 11600100","1Б":"Кран VRG131 15-0,63 арт. 11600200",1: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1 арт. 3151P002410', 2: 'Клапан регулирующий AP24-2-K3 DN15 Kvs1,6 арт. 3151P602410', 3: 'Клапан регулирующий AP24-2-K3 DN15 Kvs2,5 арт. 3152P502410', 4: 'Клапан регулирующий AP24-2-K3 DN20 Kvs4 арт. 3204P002410', 5: 'Клапан регулирующий AP24-2-K3 DN20 Kvs6,3 арт. 3206P302410', 6: 'Клапан регулирующий AP24-4-K3 DN25 Kvs10 арт. 32510P02410', 7: 'Клапан регулирующий AP24-4-K3 DN25 Kvs16 арт. 32516P02410', 8: 'Клапан регулирующий AP24-8-K3 DN32 Kvs25 арт. 33225P02410'}, '6-Ш': {4: 'Клапан регулирующий AR230-2-S K3 DN20 Kvs4 арт. 3204P02303P', 5: 'Клапан регулирующий AR230-2-S K3 DN20 Kvs6,3 арт. 3206P32303P', 6: 'Клапан регулирующий AR230-4-S K3 DN25 Kvs10 арт. 32510P2303P', 7: 'Клапан регулирующий AR230-4-S K3 DN25 Kvs16 арт. 32516P2303P', 8: 'Клапан регулирующий AR230-8-S K3 DN32 Kvs25 арт. 33225P2303P'}, '6М-Ш': {4: "Клапан регулирующий AR230-2-S K3 DN20 Kvs4 арт. 3204P02303P", 5: "Клапан регулирующий AR230-2-S K3 DN20 Kvs6,3 арт. 3206P32303P", 6:"Клапан регулирующий AR230-4-S K3 DN25 Kvs10 арт. 32510P2303P", 7:"Клапан регулирующий AR230-4-S K3 DN25 Kvs16 арт. 32516P2303P", 8:"Клапан регулирующий AR230-8-S K3 DN32 Kvs25 арт. 33225P2303P"}}

    kvs = {'1-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0}, '2-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0}, '3-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0}, '4-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0}, '4М-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0}, '5-С': {1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0}, '5М-С': {1: 1.6, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0, 9: 40.0, 10: 63.0, 11: 100.0},

    '2-Ш': {"1А":0.4, "1Б":0.63, 1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}, '4-Ш': {"1А":0.4, "1Б":0.63, 1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}, '5-Ш': {"1А":0.4, "1Б":0.63, 1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}, '5М-Ш': {"1А":0.4, "1Б":0.63, 1: 1.0, 2: 1.6, 3: 2.5, 4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}, '6-Ш': {4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}, '6М-Ш': {4: 4.0, 5: 6.3, 6: 10.0, 7: 16.0, 8: 25.0}}
    key_vec = "-".join(vector.split("-")[1:3])
    valves, kvs = valves[key_vec], kvs[key_vec]
    # repl_valve = valves[int(vector.split("-")[3])]
    dip = {}
    for item in list(valves.keys()):
        # print(real_G)
        dip[item] = dP(real_G/1000, kvs[item])
    allowed_dip = {key: p for key, p in dip.items() if 30<=p<=80}
    # print([repl_valve, valves[list(allowed_dip.keys())[list(allowed_dip.values()).index(max(list(allowed_dip.values())))]]] if len(list(allowed_dip.keys())) != 0 else [repl_valve, repl_valve])
    try:
        return valves[list(allowed_dip.keys())[list(allowed_dip.values()).index(max(list(allowed_dip.values())))]]
    except:
        return None

def rezerving(rezerv, vector):
    if rezerv:
        vec_tr = vector.split("-")[3]
        match vec_tr:
            case '1':
                return [['Клапан обратный CVS16.05.020.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.020.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '2':
                return [['Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '3':
                return [['Клапан обратный CVS16.05.025.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.025.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '4':
                return [['Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '5':
                return [['Клапан обратный CVS16.05.032.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.032.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '6':
                return [['Клапан обратный CVS16.05.040.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.040.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '7':
                return [['Клапан обратный CVS16.05.050.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.050.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '8':
                return [['Клапан обратный CVS16.05.065.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.065.016.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '9':
                return [['Клапан обратный CVS16.05.080.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.080.040.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '10':
                return [['Клапан обратный CVS16.05.100.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.100.016.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
            case '11':
                return [['Клапан обратный CVS16.05.125.16 ТУ 3700-005-81673229-2009', 2], ['Кран шаровой фланцевый КШ.Ц.Ф.125.016.Н/П.02 ТУ 3742-001-45630744-2003', 4]]
    else:
        return None

def remove_row(table, row): # Просто удаляет пустые строки
    tbl, tr = table._tbl, row._tr
    tbl.remove(tr)

def megatable(): # На данный момент бесполезная таблица с характеристиками всех векторов
    table = {'2-Ш-1А': {0:15},'2-Ш-1Б': {0:15},'4-Ш-1А': {0:15},'4-Ш-1Б': {0:15},'4М-Ш-1А': {0:15},'4М-Ш-1Б': {0:15}, '5-Ш-1А': {0:15},'5-Ш-1Б': {0:15},'5М-Ш-1А': {0:15},'5М-Ш-1Б': {0:15}, '2-Ш-1': {0: 25, 1: 'до 0,5', 2: 'DN15 K3', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-Ш-2': {0: 25, 1: '0,5-0,8', 2: 'DN15 K3', 3: 1.63, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-Ш-3': {0: 25, 1: '0,8-1', 2: 'DN15 K3', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-Ш-4': {0: 32, 1: '1-2', 2: 'DN20 K3', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '2-Ш-5': {0: 32, 1: '2-3,5', 2: 'DN20 K3', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '2-Ш-6': {0: 32, 1: '3,5-6', 2: 'DN25 K3', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '2-Ш-7': {0: 40, 1: '6-10', 2: 'DN25 K3', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '2-Ш-8': {0: 40, 1: '10-14', 2: 'DN40 K3', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '4-Ш-1': {0: 25, 1: 'до 0,5', 2: 'DN15 K3', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '4-Ш-2': {0: 25, 1: '0,5-0,8', 2: 'DN15 K3', 3: 1.63, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '4-Ш-3': {0: 25, 1: '0,8-1', 2: 'DN15 K3', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '4-Ш-4': {0: 32, 1: '1-2', 2: 'DN20 K3', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4-Ш-5': {0: 32, 1: '2-3,5', 2: 'DN20 K3', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4-Ш-6': {0: 32, 1: '3,5-6', 2: 'DN25 K3', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4-Ш-7': {0: 40, 1: '6-10', 2: 'DN25 K3', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '4-Ш-8': {0: 40, 1: '10-14', 2: 'DN40 K3', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '5-Ш-1': {0: 25, 1: 'до 0,5', 2: 'DN15 K3', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-2': {0: 25, 1: '0,5-0,8', 2: 'DN15 K3', 3: 1.63, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-3': {0: 25, 1: '0,8-1', 2: 'DN15 K3', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-4': {0: 32, 1: '1-2', 2: 'DN20 K3', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-5': {0: 32, 1: '2-3,5', 2: 'DN20 K3', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-6': {0: 32, 1: '3,5-6', 2: 'DN25 K3', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-Ш-7': {0: 40, 1: '6-10', 2: 'DN25 K3', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '5-Ш-8': {0: 40, 1: '10-14', 2: 'DN40 K3', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-4-S', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '5М-Ш-1': {0: 25, 1: 'до 0,5', 2: 'DN15 K3', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-2': {0: 25, 1: '0,5-0,8', 2: 'DN15 K3', 3: 1.63, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-3': {0: 25, 1: '0,8-1', 2: 'DN15 K3', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-4': {0: 32, 1: '1-2', 2: 'DN20 K3', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-5': {0: 32, 1: '2-3,5', 2: 'DN20 K3', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-6': {0: 32, 1: '3,5-6', 2: 'DN25 K3', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-Ш-7': {0: 40, 1: '6-10', 2: 'DN25 K3', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-2-S', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '5М-Ш-8': {0: 40, 1: '10-14', 2: 'DN40 K3', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '4,5 Вт', 7: 'АР24-4-S', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '6-Ш-4': {0: '3/4', 1: '2,7', 2: 'Клапан регулирующий  K3 DN20 Kvs4 ', 3: 4, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6-Ш-5': {0: '3/4', 1: '4,2', 2: 'Клапан регулирующий  K3 DN20 Kvs6,3 ', 3: 6.3, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6-Ш-6': {0: '1', 1: '6,8', 2: 'Клапан регулирующий  K3 DN25 Kvs10 ', 3: 10, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-4-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6-Ш-7': {0: '11/4', 1: '10,9', 2: 'Клапан регулирующий  K3 DN25 Kvs16', 3: 16, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-4-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6-Ш-8': {0: '11/2', 1: '17,0', 2: 'Клапан регулирующий K3 DN32 Kvs25 ', 3: 25, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: ' AR230-8-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6М-Ш-4': {0: '3/4', 1: '2,7', 2: 'Клапан регулирующий  K3 DN20 Kvs4 ', 3: 4, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6М-Ш-5': {0: '3/4', 1: '4,2', 2: 'Клапан регулирующий  K3 DN20 Kvs6,3 ', 3: 6.3, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-2-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6М-Ш-6': {0: '1', 1: '6,8', 2: 'Клапан регулирующий  K3 DN25 Kvs10 ', 3: 10, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-4-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6М-Ш-7': {0: '11/4', 1: '10,9', 2: 'Клапан регулирующий  K3 DN25 Kvs16', 3: 16, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: 'AR230-4-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '6М-Ш-8': {0: '11/2', 1: '17,0', 2: 'Клапан регулирующий K3 DN32 Kvs25 ', 3: 25, 4: '220 В- 50Гц', 5: 'отк/закр', 6: '4 Вт', 7: ' AR230-8-S', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '1-С-1': {0: 20, 1: 'до 0,5', 2: 'КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-2': {0: 25, 1: '0,5-0,8', 2: 'КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-3': {0: 25, 1: '0,8-1', 2: 'КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-4': {0: 32, 1: '1-2', 2: 'КПСР 2.11-15-4-0-СЧ-1,6-1-150-У', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-5': {0: 32, 1: '2-3,5', 2: 'КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-6': {0: 40, 1: '3,5-6', 2: 'КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-7': {0: 50, 1: '6-10', 2: 'КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-8': {0: 65, 1: '10-14', 2: 'КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '1-С-9': {0: 80, 1: '14-22', 2: 'КПСР 2.11-50-40-0-СЧ-1,6-1-150-У', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '2-С-1': {0: 20, 1: 'до 0,5', 2: 'КПСР 2.11-15-1-0-СЧ-1,6-1-150-У', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-С-2': {0: 25, 1: '0,5-0,8', 2: 'КПСР 2.11-15-1,6-0-СЧ-1,6-1-150-У', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-С-3': {0: 25, 1: '0,8-1', 2: 'КПСР 2.11-15-2,5-0-СЧ-1,6-1-150-У', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.4, 13: 72}, '2-С-4': {0: 32, 1: '1-2', 2: 'КПСР 2.11-15-4-0-СЧ-1,6-1-150-У', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '2-С-5': {0: 32, 1: '2-3,5', 2: 'КПСР 2.11-20-6,3-0-СЧ-1,6-1-150-У', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '2-С-6': {0: 40, 1: '3,5-6', 2: 'КПСР 2.11-25-10-0-СЧ-1,6-1-150-У', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-750F', 9: 10, 10: 2, 11: '1х230', 12: 3.4, 13: 750}, '2-С-7': {0: 50, 1: '6-10', 2: 'КПСР 2.11-32-16-0-СЧ-1,6-1-150-У', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '2-С-8': {0: 65, 1: '10-14', 2: 'КПСР 2.11-40-25-0-СЧ-1,6-1-150-У', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 50/7', 9: '24', 10: '7,2', 11: '3х400', 12: 1.19, 13: 610}, '2-С-9': {0: 80, 1: '14-22', 2: 'КПСР 2.11-50-40-0-СЧ-1,6-1-150-У', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 65/10', 9: '42', 10: '9', 11: '3х400', 12: 1.67, 13: 845}, '2-С-10': {0: 100, 1: '22-40', 2: 'КПСР 2.11-65-63-0-СЧ-1,6-1-150-У', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/10', 9: '66', 10: '9,4', 11: '3х400', 12: 3.13, 13: 1590}, '2-С-11': {0: 125, 1: '40-60', 2: 'КПСР 2.11-80-100-0-СЧ-1,6-1-150-У', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/15', 9: 75, 10: 18, 11: '3х400', 12: 4.85, 13: 2400}, '3-С-1': {0: 20, 1: 'до 0,5', 2: 'КССР 15-1-0-СЧ-1,6-1-150-У4', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-2': {0: 25, 1: '0,5-0,8', 2: 'КССР 15-1,6-0-СЧ-1,6-1-150-У4', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-3': {0: 25, 1: '0,8-1', 2: 'КССР 15-2,5-0-СЧ-1,6-1-150-У4', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-4': {0: 32, 1: '1-2', 2: 'КССР 15-4-0-СЧ-1,6-1-150-У4', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-5': {0: 32, 1: '2-3,5', 2: 'КССР 20-6,3-0-СЧ-1,6-1-150-У4', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-6': {0: 40, 1: '3,5-6', 2: 'КССР 25-10-0-СЧ-1,6-1-150-У4', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-7': {0: 50, 1: '6-10', 2: 'КССР 32-16-0-СЧ-1,6-1-150-У4', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-8': {0: 65, 1: '10-14', 2: 'КССР 40-25-0-СЧ-1,6-1-150-У4', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-9': {0: 80, 1: '14-22', 2: 'КССР 50-40-0-СЧ-1,6-1-150-У4', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-10': {0: 100, 1: '22-40', 2: 'КССР 65-63-0-СЧ-1,6-1-150-У4', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '3-С-11': {0: 125, 1: '40-60', 2: 'КССР 80-100-0-СЧ-1,6-1-150-У4', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: '-', 9: '-', 10: '-', 11: '-', 12: '-', 13: '-'}, '4-С-1': {0: 20, 1: 'до 0,5', 2: 'КССР 15-1-0-СЧ-1,6-1-150-У4', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4-С-2': {0: 25, 1: '0,5-0,8', 2: 'КССР 15-1,6-0-СЧ-1,6-1-150-У4', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4-С-3': {0: 25, 1: '0,8-1', 2: 'КССР 15-2,5-0-СЧ-1,6-1-150-У4', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4-С-4': {0: 32, 1: '1-2', 2: 'КССР 15-4-0-СЧ-1,6-1-150-У4', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4-С-5': {0: 32, 1: '2-3,5', 2: 'КССР 20-6,3-0-СЧ-1,6-1-150-У4', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4-С-6': {0: 40, 1: '3,5-6', 2: 'КССР 25-10-0-СЧ-1,6-1-150-У4', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-750F', 9: 10, 10: 2, 11: '1х230', 12: 3.4, 13: 750}, '4-С-7': {0: 50, 1: '6-10', 2: 'КССР 32-16-0-СЧ-1,6-1-150-У4', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '4-С-8': {0: 65, 1: '10-14', 2: 'КССР 40-25-0-СЧ-1,6-1-150-У4', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 50/7', 9: '24', 10: '7,2', 11: '3х400', 12: 1.19, 13: 610}, '4-С-9': {0: 80, 1: '14-22', 2: 'КССР 50-40-0-СЧ-1,6-1-150-У4', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 65/10', 9: '42', 10: '9', 11: '3х400', 12: 1.67, 13: 845}, '4-С-10': {0: 100, 1: '22-40', 2: 'КССР 65-63-0-СЧ-1,6-1-150-У4', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/10', 9: '66', 10: '9,4', 11: '3х400', 12: 3.13, 13: 1590}, '4-С-11': {0: 125, 1: '40-60', 2: 'КССР 80-100-0-СЧ-1,6-1-150-У4', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/15', 9: 75, 10: 18, 11: '3х400', 12: 4.85, 13: 2400}, '4М-С-1': {0: 20, 1: 'до 0,5', 2: 'КССР 15-1-0-СЧ-1,6-1-150-У4', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4М-С-2': {0: 25, 1: '0,5-0,8', 2: 'КССР 15-1,6-0-СЧ-1,6-1-150-У4', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4М-С-3': {0: 25, 1: '0,8-1', 2: 'КССР 15-2,5-0-СЧ-1,6-1-150-У4', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/6-180G', 9: 3, 10: 1, 11: '1х230', 12: 0.37, 13: 72}, '4М-С-4': {0: 32, 1: '1-2', 2: 'КССР 15-4-0-СЧ-1,6-1-150-У4', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4М-С-5': {0: 32, 1: '2-3,5', 2: 'КССР 20-6,3-0-СЧ-1,6-1-150-У4', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '4М-С-6': {0: 40, 1: '3,5-6', 2: 'КССР 25-10-0-СЧ-1,6-1-150-У4', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-750F', 9: 10, 10: 2, 11: '1х230', 12: 3.4, 13: 750}, '4М-С-7': {0: 50, 1: '6-10', 2: 'КССР 32-16-0-СЧ-1,6-1-150-У4', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '4М-С-8': {0: 65, 1: '10-14', 2: 'КССР 40-25-0-СЧ-1,6-1-150-У4', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 50/7', 9: '24', 10: '7,2', 11: '3х400', 12: 1.19, 13: 610}, '4М-С-9': {0: 80, 1: '14-22', 2: 'КССР 50-40-0-СЧ-1,6-1-150-У4', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 65/10', 9: '42', 10: '9', 11: '3х400', 12: 1.67, 13: 845}, '4М-С-10': {0: 100, 1: '22-40', 2: 'КССР 65-63-0-СЧ-1,6-1-150-У4', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/10', 9: '66', 10: '9,4', 11: '3х400', 12: 3.13, 13: 1590}, '4М-С-11': {0: 125, 1: '40-60', 2: 'КССР 80-100-0-СЧ-1,6-1-150-У4', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/15', 9: 75, 10: 18, 11: '3х400', 12: 4.85, 13: 2400}, '5-С-1': {0: 20, 1: 'до 0,5', 2: 'КССР 15-1-0-СЧ-1,6-1-150-У4', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-С-2': {0: 25, 1: '0,5-0,8', 2: 'КССР 15-1,6-0-СЧ-1,6-1-150-У4', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-С-3': {0: 25, 1: '0,8-1', 2: 'КССР 15-2,5-0-СЧ-1,6-1-150-У4', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-С-4': {0: 32, 1: '1-2', 2: 'КССР 15-4-0-СЧ-1,6-1-150-У4', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-С-5': {0: 32, 1: '2-3,5', 2: 'КССР 20-6,3-0-СЧ-1,6-1-150-У4', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5-С-6': {0: 40, 1: '3,5-6', 2: 'КССР 25-10-0-СЧ-1,6-1-150-У4', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-750F', 9: 10, 10: 2, 11: '1х230', 12: 3.4, 13: 750}, '5-С-7': {0: 50, 1: '6-10', 2: 'КССР 32-16-0-СЧ-1,6-1-150-У4', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '5-С-8': {0: 65, 1: '10-14', 2: 'КССР 40-25-0-СЧ-1,6-1-150-У4', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '5-С-9': {0: 80, 1: '14-22', 2: 'КССР 50-40-0-СЧ-1,6-1-150-У4', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 65/13', 9: '48', 10: '12,1', 11: '3х400', 12: 2.93, 13: 1450}, '5-С-10': {0: 100, 1: '22-40', 2: 'КССР 65-63-0-СЧ-1,6-1-150-У4', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/10', 9: '66', 10: '9,4', 11: '3х400', 12: 3.13, 13: 1590}, '5-С-11': {0: 125, 1: '40-60', 2: 'КССР 80-100-0-СЧ-1,6-1-150-У4', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/15', 9: 75, 10: 18, 11: '3х400', 12: 4.85, 13: 2400}, '5М-С-1': {0: 20, 1: 'до 0,5', 2: 'КССР 15-1-0-СЧ-1,6-1-150-У4', 3: 1, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-С-2': {0: 25, 1: '0,5-0,8', 2: 'КССР 15-1,6-0-СЧ-1,6-1-150-У4', 3: 1.6, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-С-3': {0: 25, 1: '0,8-1', 2: 'КССР 15-2,5-0-СЧ-1,6-1-150-У4', 3: 2.5, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 25/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-С-4': {0: 32, 1: '1-2', 2: 'КССР 15-4-0-СЧ-1,6-1-150-У4', 3: 4, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-С-5': {0: 32, 1: '2-3,5', 2: 'КССР 20-6,3-0-СЧ-1,6-1-150-У4', 3: 6.3, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 32/8-180G', 9: 9, 10: 2, 11: '1х230', 12: 1.2, 13: 270}, '5М-С-6': {0: 40, 1: '3,5-6', 2: 'КССР 25-10-0-СЧ-1,6-1-150-У4', 3: 10, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-750F', 9: 10, 10: 2, 11: '1х230', 12: 3.4, 13: 750}, '5М-С-7': {0: 50, 1: '6-10', 2: 'КССР 32-16-0-СЧ-1,6-1-150-У4', 3: 16, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'LRS 40-1100F', 9: 11, 10: 3, 11: '1х230', 12: 4.9, 13: 1100}, '5М-С-8': {0: 65, 1: '10-14', 2: 'КССР 40-25-0-СЧ-1,6-1-150-У4', 3: 25, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 50/10', 9: '32', 10: '10', 11: '3х400', 12: 1.73, 13: 880}, '5М-С-9': {0: 80, 1: '14-22', 2: 'КССР 50-40-0-СЧ-1,6-1-150-У4', 3: 40, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 65/13', 9: '48', 10: '12,1', 11: '3х400', 12: 2.93, 13: 1450}, '5М-С-10': {0: 100, 1: '22-40', 2: 'КССР 65-63-0-СЧ-1,6-1-150-У4', 3: 63, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/10', 9: '66', 10: '9,4', 11: '3х400', 12: 3.13, 13: 1590}, '5М-С-11': {0: 125, 1: '40-60', 2: 'КССР 80-100-0-СЧ-1,6-1-150-У4', 3: 100, 4: 24, 5: 'управл.0…10В=', 6: '25 Вт', 7: ' Катрабел TW500-X24-S.12', 8: 'TOP-S 80/15', 9: 75, 10: 18, 11: '3х400', 12: 4.85, 13: 2400}}
    return table

def sizes_and_weight_recognition(scheme:str, valve:str, TR:str): # Определяем длину, межосевое расстояние и массу ВЕКТОРа
    match scheme:
        case "1":
            match TR:
                case "1":
                    return {'L': 990, "weight": 35, "H1": 505}
                case "2":
                    return {'L': 1020, "weight": 40, "H1": 505}
                case "3":
                    return {'L': 1020, "weight": 40, "H1": 505}
                case "4":
                    return {'L': 1035, "weight": 55, "H1": 505}
                case "5":
                    return {'L': 1055, "weight": 55, "H1": 505}
                case "6":
                    return {'L': 1120, "weight": 65, "H1": 505}
                case "7":
                    return {'L': 1215, "weight": 90, "H1": 505}
                case "8":
                    return {'L': 1270, "weight": 95, "H1": 505}
                case "9":
                    return {'L': 1330, "weight": 142, "H1": 505}
        case "3":
            match TR:
                case "1":
                    return {'L': 470, "weight": 27, "H1": 505}
                case "2":
                    return {'L': 500, "weight": 31, "H1": 505}
                case "3":
                    return {'L': 500, "weight": 31, "H1": 505}
                case "4":
                    return {'L': 500, "weight": 38, "H1": 505}
                case "5":
                    return {'L': 520, "weight": 38, "H1": 505}
                case "6":
                    return {'L': 560, "weight": 44, "H1": 505}
                case "7":
                    return {'L': 610, "weight": 55, "H1": 505}
                case "8":
                    return {'L': 660, "weight": 70, "H1": 505}
                case "9":
                    return {'L': 690, "weight": 85, "H1": 505}
                case "10":
                    return {'L': 780, "weight": 122, "H1": 505}
                case "11":
                    return {'L': 860, "weight": 130, "H1": 505}
        # Схема 2
        case "2":
            match valve:
                # Седельный клапан
                case "С":
                    match TR:
                        case "1":
                            return {"Ду": 20, "L": 1450, "L1": 1120, "L2": 990, "H": 910, "H1": 505, "B": 370, "weight": 55}
                        case "2":
                            return {"Ду": 25, "L": 1475, "L1": 1135, "L2": 1015, "H": 910, "H1": 505, "B": 370, "weight": 60}
                        case "3":
                            return {"Ду": 25, "L": 1480, "L1": 1135, "L2": 1015, "H": 910, "H1": 505, "B": 370, "weight": 60}
                        case "4":
                            return {"Ду": 32, "L": 1500, "L1": 1175, "L2": 1055, "H": 910, "H1": 505, "B": 370, "weight": 70}
                        case "5":
                            return {"Ду": 32, "L": 1615, "L1": 1175, "L2": 1055, "H": 910, "H1": 505, "B": 370, "weight": 75}
                        case "6":
                            return {"Ду": 40, "L": 1700, "L1": 1400, "L2": 1290, "H": 915, "H1": 505, "B": 435, "weight": 105}
                        case "7":
                            return {"Ду": 50, "L": 1760, "L1": 1505, "L2": 1400, "H": 930, "H1": 505, "B": 435, "weight": 125}
                        case "8":
                            return {"Ду": 65, "L": 1855, "L1": 1590, "L2": 1570, "H": 945, "H1": 505, "B": 595, "weight": 165}
                        case "9":
                            return {"Ду": 80, "L": 2005, "L1": 1690, "L2": 1660, "H": 1060, "H1": 565, "B": 605, "weight": 195}
                        case "10":
                            return {"Ду": 100, "L": 2180, "L1": 1895, "L2": 1850, "H": 1185, "H1": 640, "B": 625, "weight": 270}
                        case "11":
                            return {"Ду": 125, "L": 2320, "L1": 2015, "L2": 1945, "H": 1300, "H1": 730, "B": 645, "weight": 370}
                        case _:
                            return None
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "1А":
                            return {"G": "½", "L": 1000, "H1": 220, "B": 350, "weight": 11}
                        case "1Б":
                            return {"G": "1", "L": 1000, "H1": 220, "B": 350, "weight": 11}
                        case "1" | "2" | "3":
                            return {"G": "1", "L": 1000, "H1": 220, "B": 350, "weight": 12}
                        case "4":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 17}
                        case "5" | "6":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 18}
                        case "7":
                            return {"G": "1½", "L": 1190, "H1": 370, "B": 350, "weight": 38}
                        case "8":
                            return {"G": "2", "L": 1400, "H1": 370, "B": 425, "weight": 43}
                        case _:
                            return None
                case _:
                    return None
        # Схема 4
        case "4":
            match valve:
                # Седельный клапан
                case "С":
                    match TR:
                        case "1":
                            return {"Ду": 20, "L": 1500, "L1": 965, "H": 920, "H1": 505, "B": 370, "weight": 59}
                        case "2":
                            return {"Ду": 25, "L": 1560, "L1": 1015, "H": 930, "H1": 505, "B": 370, "weight": 66}
                        case "3":
                            return {"Ду": 25, "L": 1560, "L1": 1015, "H": 930, "H1": 505, "B": 370, "weight": 66}
                        case "4":
                            return {"Ду": 32, "L": 1600, "L1": 1015, "H": 930, "H1": 505, "B": 370, "weight": 93}
                        case "5":
                            return {"Ду": 32, "L": 1680, "L1": 1070, "H": 930, "H1": 505, "B": 370, "weight": 95}
                        case "6":
                            return {"Ду": 40, "L": 1735, "L1": 1350, "H": 960, "H1": 505, "B": 435, "weight": 114}
                        case "7":
                            return {"Ду": 50, "L": 1755, "L1": 1415, "H": 1055, "H1": 505, "B": 435, "weight": 124}
                        case "8":
                            return {"Ду": 65, "L": 1890, "L1": 1595, "H": 1065, "H1": 505, "B": 595, "weight": 159}
                        case "9":
                            return {"Ду": 80, "L": 2150, "L1": 1855, "H": 1180, "H1": 640, "B": 605, "weight": 201}
                        case "10":
                            return {"Ду": 100, "L": 2240, "L1": 1915, "H": 1185, "H1": 640, "B": 625, "weight": 285}
                        case "11":
                            return {"Ду": 125, "L": 2460, "L1": 2085, "H": 1270, "H1": 700, "B": 645, "weight": 370}
                        case _:
                            return None
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "1А" | "1Б":
                            return {"G": "½", "L": 1000, "H1": 220, "B": 350, "weight": 16}
                        case "1" | "2" | "3":
                            return {"G": "1", "L": 1000, "H1": 220, "B": 350, "weight": 16}
                        case "4":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 19}
                        case "5" | "6":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 20}
                        case "7":
                            return {"G": "1½", "L": 1450, "H1": 355, "B": 350, "weight": 42}
                        case "8":
                            return {"G": "2", "L": 1450, "H1": 355, "B": 425, "weight": 56}
                        case _:
                            return None
                case _:
                    return None
        # Схема 4М
        case "4М":
            match valve:
                # Седельный клапан
                case "С":
                    match TR:
                        case "1":
                            return {"Ду": 20, "L": 1415, "L1": 975, "H": 910, "H1": 505, "B": 370, "weight": 65}
                        case "2" | "3":
                            return {"Ду": 25, "L": 1435, "L1": 985, "H": 910, "H1": 505, "B": 370, "weight": 70}
                        case "4":
                            return {"Ду": 32, "L": 1475, "L1": 1065, "H": 910, "H1": 505, "B": 370, "weight": 82}
                        case "5":
                            return {"Ду": 32, "L": 1565, "L1": 1065, "H": 910, "H1": 505, "B": 370, "weight": 83}
                        case "6":
                            return {"Ду": 40, "L": 1640, "L1": 1090, "H": 860, "H1": 505, "B": 435, "weight": 107}
                        case "7":
                            return {"Ду": 50, "L": 1695, "L1": 1195, "H": 870, "H1": 505, "B": 435, "weight": 131}
                        case "8":
                            return {"Ду": 65, "L": 1895, "L1": 1355, "H": 930, "H1": 505, "B": 595, "weight": 200}
                        case "9":
                            return {"Ду": 80, "L": 2160, "L1": 1470, "H": 1020, "H1": 640, "B": 605, "weight": 245}
                        case "10":
                            return {"Ду": 100, "L": 2330, "L1": 1640, "H": 1310, "H1": 640, "B": 625, "weight": 320}
                        case "11":
                            return {"Ду": 125, "L": 2460, "L1": 1700, "H": 1420, "H1": 700, "B": 540, "weight": 434}
                        case _:
                            return None
                # Шаровой клапан
                case "Ш":
                    return None
                case _:
                    return None
        # Схема 5
        case "5":
            match valve:
                # Седельный клапан
                case "С":
                    match TR:
                        case "1":
                            return {"Ду": 20, "L": 1200, "L1": 935, "H": 920, "H1": 505, "B": 420, "weight": 50}
                        case "2" | "3":
                            return {"Ду": 25, "L": 1230, "L1": 960, "H": 930, "H1": 505, "B": 420, "weight": 58}
                        case "4":
                            return {"Ду": 32, "L": 1345, "L1": 960, "H": 930, "H1": 505, "B": 420, "weight": 82}
                        case "5":
                            return {"Ду": 32, "L": 1355, "L1": 965, "H": 930, "H1": 505, "B": 430, "weight": 85}
                        case "6":
                            return {"Ду": 40, "L": 1415, "L1": 1070, "H": 960, "H1": 505, "B": 480, "weight": 133}
                        case "7":
                            return {"Ду": 50, "L": 1515, "L1": 1250, "H": 985, "H1": 505, "B": 510, "weight": 175}
                        case "8":
                            return {"Ду": 65, "L": 1710, "L1": 1410, "H": 995, "H1": 505, "B": 550, "weight": 205}
                        case "9":
                            return {"Ду": 80, "L": 1885, "L1": 1520, "H": 1050, "H1": 505, "B": 550, "weight": 230}
                        case "10":
                            return {"Ду": 100, "L": 1945, "L1": 1665, "H": 1160, "H1": 640, "B": 630, "weight": 255}
                        case "11":
                            return {"Ду": 125, "L": 2205, "L1": 1810, "H": 1240, "H1": 700, "B": 640, "weight": 335}
                        case _:
                            return None
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "1А" | "1Б":
                            return {"G": "½", "L": 1000, "H1": 220, "B": 350, "weight": 13}
                        case "1" | "2" | "3":
                            return {"G": "1", "L": 1000, "H1": 220, "B": 350, "weight": 14}
                        case "4":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 17}
                        case "5" | "6":
                            return {"G": "1¼", "L": 1000, "H1": 220, "B": 350, "weight": 18}
                        case "7":
                            return {"G": "1½", "L": 1030, "H1": 285, "B": 410, "weight": 34}
                        case "8":
                            return {"G": "2", "L": 1100, "H1": 285, "B": 425, "weight": 42}
                        case _:
                            return None
        # Схема 5М
        case "5М":
            match valve:
                # Седельный клапан
                case "С":
                    match TR:
                        case "1":
                            return {"Ду": 20, "L": 1315, "L1": 935, "L2": 1160, "H": 920, "H1": 505, "B": 420, "weight": 50}
                        case "2":
                            return {"Ду": 25, "L": 1345, "L1": 965, "L2": 1180, "H": 930, "H1": 505, "B": 420, "weight": 58}
                        case "3":
                            return {"Ду": 25, "L": 1345, "L1": 965, "L2": 1180, "H": 930, "H1": 505, "B": 420, "weight": 58}
                        case "4":
                            return {"Ду": 32, "L": 1340, "L1": 955, "L2": 1160, "H": 930, "H1": 505, "B": 420, "weight": 82}
                        case "5":
                            return {"Ду": 32, "L": 1355, "L1": 975, "L2": 1170, "H": 930, "H1": 505, "B": 430, "weight": 85}
                        case "6":
                            return {"Ду": 40, "L": 1440, "L1": 1135, "L2": 1240, "H": 960, "H1": 505, "B": 480, "weight": 133}
                        case "7":
                            return {"Ду": 50, "L": 1460, "L1": 1245, "L2": 1225, "H": 985, "H1": 505, "B": 510, "weight": 175}
                        case "8":
                            return {"Ду": 65, "L": 1675, "L1": 1400, "L2": 1405, "H": 996, "H1": 505, "B": 550, "weight": 205}
                        case "9":
                            return {"Ду": 80, "L": 1775, "L1": 1525, "L2": 1490, "H": 1100, "H1": 555, "B": 550, "weight": 230}
                        case "10":
                            return {"Ду": 100, "L": 1940, "L1": 1660, "L2": 1635, "H": 1160, "H1": 640, "B": 630, "weight": 255}
                        case "11":
                            return {"Ду": 125, "L": 2115, "L1": 1805, "L2": 1785, "H": 1240, "H1": 700, "B": 640, "weight": 335}
                        case _:
                            return None
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "1А" | "1Б":
                            return {"G": "½", "L": 1000, "H1": 240, "B": 350, "weight": 15}
                        case "1" | "2" | "3":
                            return {"G": "1", "L": 1000, "H1": 240, "B": 350, "weight": 15}
                        case "4":
                            return {"G": "1¼", "L": 1000, "H1": 240, "B": 350, "weight": 18}
                        case "5" | "6":
                            return {"G": "1¼", "L": 1000, "H1": 240, "B": 350, "weight": 19}
                        case "7":
                            return {"G": "1½", "L": 1040, "H1": 370, "B": 410, "weight": 35}
                        case "8":
                            return {"G": "2", "L": 1155, "H1": 370, "B": 425, "weight": 45}
                        case _:
                            return None
        # Схема 6
        case "6":
            match valve:
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "4" | "5":
                            return {"G": "¾", "L": 570, "L1": 350, "H":350, "H1": 180, "B": 230, "weight": 11}
                        case "6":
                            return {"G": "1", "L": 630, "L1": 395, "H":380, "H1": 200, "B": 230, "weight": 13}
                        case "7":
                            return {"G": "1¼", "L": 680, "L1": 430, "H":430, "H1": 215, "B": 250, "weight": 16}
                        case "8":
                            return {"G": "1½", "L": 740, "L1": 450, "H":450, "H1": 230, "B": 250, "weight": 20}
                        case _:
                            return None
                case _:
                    return None
        # Схема 6М
        case "6М":
            match valve:
                # Шаровой клапан
                case "Ш":
                    match TR:
                        case "4" | "5":
                            return {"G": "¾", "L": 880, "L1": 430, "H":350, "H1": 180, "B": 230, "weight": 17}
                        case "6":
                            return {"G": "1", "L": 930, "L1": 455, "H":380, "H1": 200, "B": 230, "weight": 17}
                        case "7":
                            return {"G": "1¼", "L": 970, "L1": 500, "H":430, "H1": 215, "B": 250, "weight": 22}
                        case "8":
                            return {"G": "1½", "L": 1010, "L1": 540, "H":450, "H1": 230, "B": 250, "weight": 25}
                        case _:
                            return None
                case _:
                    return None
        case _:
            return None

def gabar_table(doc, vector, rezerv): # Заполняет таблицу с габаритами в шаблоне
    table = doc.tables[3]
    inf = megatable()["-".join(vector.split("-")[1:4])]
    table.rows[0].cells[-1].paragraphs[0].text = f"{str(inf[0])} (резьбовое)" if vector.split("-")[2] == "Ш" else f"ДУ {str(inf[0])} (фланцевое)"
    table.rows[1].cells[-1].paragraphs[0].text = {"П": "правая", "Л": "левая"}[vector.split("-")[4]]
    vecspli = vector.split("-")
    L = sizes_and_weight_recognition(str(vecspli[1]), str(vecspli[2]), str(vecspli[3]))["L"]
    Wei = sizes_and_weight_recognition(str(vecspli[1]), str(vecspli[2]), str(vecspli[3]))["weight"]
    h1 = sizes_and_weight_recognition(str(vecspli[1]), str(vecspli[2]), str(vecspli[3]))["H1"]
    table.rows[2].cells[-1].paragraphs[0].text = str(L) if not rezerv else " "
    table.rows[-1].cells[-1].paragraphs[0].text = str(Wei) if not rezerv else " "
    table.rows[-2].cells[-1].paragraphs[0].text = str(h1) if not rezerv else " "

def tab_regime(minfos, dinfos, doc): # Заполняет таблицу режима работы
    table = doc.tables[2]
    #st.write(minfos)
    print(minfos['Доля гликоля'])
    table.rows[0].cells[-1].paragraphs[0].text = """Вода, соответствует требованиям \nСП 124.13330.2012""" if float(minfos['Доля гликоля']) == 0 else f"На основании {int(float(minfos['Доля гликоля'])*100)}% гликоля"
    table.rows[2].cells[-1].paragraphs[0].text = str(round(float(minfos["Расход жидкости"])/1000, 3))
    table.rows[1].cells[-1].paragraphs[0].text = temps(minfos["Вектор"].split("-")[2], minfos["Вектор"].split("-")[1])

def underhead_tab(minfos, dinfos, doc,developer_name): # Заполняе таблицу с юридической информацией
    table = doc.tables[1]
    rows = table.rows
    global razrab
    rows[0].cells[1].paragraphs[0].text = dinfos[1]
    rows[1].cells[1].paragraphs[0].text = dinfos[2]
    rows[-1].cells[1].paragraphs[0].text = dinfos[0]
    rows[-1].cells[-1].paragraphs[0].text = minfos["Вектор"]
    rows[-2].cells[1].paragraphs[0].text = dinfos[3]
    rows[2].cells[-1].paragraphs[0].text = developer_name

def only_one_minfo(all_minfos, i): # Вычленяет одну строку из таблицы с ВЕКТОРами
    minf = {}
    for key in all_minfos.keys():
        minf[key] = all_minfos[key][i]
    return minf

def head_tab(vector, BZ, doc): # Заполняет шапку бланка
    from datetime import date
    current_date = ".".join(str(date.today()).split("-")[::-1])
    table = doc.tables[0].rows[0].cells[0].paragraphs[0].text = f"{vector}\nУзел Регулирующий для бланк-заказа\n№{BZ} от {current_date}"

def work_with_template(way_to_excel): # Руководящий модуль по работе с шаблоном для ВЕРОСы
    if "ВЕКТОР канал" in way_to_excel:
        work_with_canal_template(way_to_excel)
    else:
        axlsx = looking_in_excel(way_to_excel)
        #hway = '\\'.join(way_to_excel.split('/')[:-1])
        fway = way_to_excel
        try:
            os.mkdir(way_to_excel)
        except:
            pass
        all_dinfos = app_infos(axlsx)
        blanki = dict(pd.read_excel(way_to_excel).to_dict())
        for i in range(len(blanki["Вектор"])):
            G = blanki["Расход поправочный"][i]
            vector = blanki["Вектор"][i]
            doc = Document("template_1.docx")
            head_tab(vector, axlsx["Номер БЗ"][i], doc)
            all_minfos = axlsx
            minfos = only_one_minfo(all_minfos, i)
            underhead_tab(minfos, all_dinfos[i], doc, 'zzz')
            block = f"{minfos['Номер БЗ']} - {minfos['Блок']}"
            tab_regime(minfos, all_dinfos[i] ,doc)
            gabar_table(doc, vector, minfos["Резерв"])
            compl_tab_with_table(vector, doc, block, fway, G, minfos["Резерв"])
            print(f"БЛАНК {minfos['Номер БЗ']} - {minfos['Блок']} >>>>>>>>>> СФОРМИРОВАН")

def work_with_canal_template(way_to_excel,blanks,developer_name): # # Руководящий модуль по работе с шаблоном для каналки
    #hway = '\\'.join(way_to_excel.split('/')[:-1])
    try:
        bio_doc = io.BytesIO()
    except:
        pass
    axlsx = looking_in_excel(way_to_excel)
    blanki = dict(pd.read_excel(way_to_excel).to_dict())
    all_dinfos = app_infos_canal(axlsx,blanks)
    doc_list = []
    name_doc_list = []
    for i in range(len(blanki["Вектор"])):
        G = blanki["Расход поправочный"][i]
        print(G)
        vector = blanki["Вектор"][i]
        doc = Document("template_1.docx")
        head_tab(vector, axlsx["Номер БЗ"][i], doc)
        all_minfos = axlsx
        minfos = only_one_minfo(all_minfos, i)
        tab_regime(minfos, all_dinfos[i] ,doc)
        underhead_tab(minfos, all_dinfos[i], doc, developer_name)
        gabar_table(doc, vector, minfos["Резерв"])
        block = f"{minfos['Номер БЗ']} - {minfos['Блок']}"
        name_doc = minfos['Бланк']
        doc = compl_tab_with_table(vector, doc, block, bio_doc, G, minfos['Резерв'])
        doc_list.append(doc)
        name_doc_list.append(name_doc)
        print(f"БЛАНК {minfos['Номер БЗ']} - {minfos['Блок']} >>>>>>>>>> СФОРМИРОВАН")
    return doc_list, name_doc_list

def looking_in_excel(way_excel): # Посмотр данных из эксель таблицы
    elements = dict(pd.read_excel(way_excel).to_dict())
    for elem in elements.keys():
        elements[elem] = list(elements[elem].values())
    return elements

def app_infos_canal(minfos,test_blank): # Выхватывает недостающие в таблице данные из бланка каналки
    manager, object_, organiz, nazv = "", "", "", ""
    dop_info = []
    i = 0
    print(minfos)
    for way in test_blank:
        inf_doc = Document(way)
        table = inf_doc.tables[0]
        for row in table.rows[5:8]:
            # i += 1
            for cell in row.cells:
                if "объект:" in cell.text.lower():
                    object_ = row.cells[2].text
                    continue
                else:
                    object_ = "" if len(object_) == 0 else object_
                if "заказчик:" in cell.text.lower():
                    organiz = row.cells[2].text
                    continue
                else:
                    organiz = "" if len(organiz) == 0 else organiz
                if "название:" in cell.text.lower():
                    nazv = row.cells[11].text
                    continue
                else:
                    nazv = "" if len(nazv) == 0 else nazv
        print(f"БЛАНК КАНАЛЬНОГО ОБОРУДОВАНИЯ {minfos['Номер БЗ'][i]} >>>>>>>>>> ПРОЧИТАН")
        i += 1
        dop_info.append([manager, object_, organiz, nazv])
    print()
    print("ПРИСТУПАЕМ К ФОРМИРОВАНИЮ БЛАНКОВ УР ВЕКТОР")
    print()
    return dop_info

def app_infos(minfos): # Выхватывает недостающие в таблице данные из бланка ВЕРОСА
    manager, object_, organiz, nazv = "", "", "", ""
    dop_info = []
    i = 0
    for way in minfos["Путь к бланку"]:
        inf_doc = Document(way)
        for table in inf_doc.tables[:2]:
            for row in table.rows:
                for cell in row.cells:
                    if "менеджер:" in cell.text.lower():
                        manager = f_all(r"менеджер: ([А-Яа-я ]+)", cell.text)[0]
                    else:
                        manager = "" if len(manager) == 0 else manager
                    if "объект:" in cell.text.lower():
                        object_ = f_all(r"объект: ([\S ]+)", cell.text)[0]
                    else:
                        object_ = "" if len(object_) == 0 else object_
                    if "организация:" in cell.text.lower():
                        organiz = f_all(r"организация: ([\S ]+)", cell.text)[0]
                    else:
                        organiz = "" if len(organiz) == 0 else organiz
                    if "название:" in cell.text.lower():
                        nazv = f_all(r"название: ([\S ]+)", cell.text)[0]
                    else:
                        nazv = "" if len(nazv) == 0 else nazv
        print(f"БЛАНК ВЕРОСА {minfos['Номер БЗ'][i]} >>>>>>>>>> ПРОЧИТАН")
        i+=1
        dop_info.append([manager, object_, organiz, nazv])
    print()
    print("ПРИСТУПАЕМ К ФОРМИРОВАНИЮ БЛАНКОВ УР ВЕКТОР")
    print()
    return dop_info




def compl_tab(vector, doc, block, bio_doc, G, rezerv): # Наполняет таблицу комплектации в шаблоне и сохраняет бланк
    from docx.shared import Mm
    print(G)
    rep_spi = valve_recognition(float(G), vector)
    elems, quanti = super_mega_giga(vector)
    #st.write(elems)
    #st.write(quanti)
    table = doc.tables[-2]
    rezez = rezerving(rezerv, vector)
    rrr = True
    if rezez is None:
        rrr = False
    else:
        elems.append(rezez[0][0])
        elems.append(rezez[1][0])
        quanti.append(rezez[0][1])
        quanti.append(rezez[1][1])
    print(elems)
    for ele in elems:
        if "клапан" in ele.lower():
            if "КССР" in ele or "КПСР" in ele or "Kvs" in ele:
                rval = ele
    rows = table.rows[1:len(elems)+1]
    if not rep_spi is None:
        for i in range(len(elems)):
            rows[i].cells[1].paragraphs[0].text = elems[i].replace(rval, rep_spi)
            rows[i].cells[2].paragraphs[0].text = f"{str(quanti[i]*2)}" if (rrr and ("насос" in elems[i].lower())) else f"{str(quanti[i])}"
    else:
        for i in range(len(elems)):
            rows[i].cells[1].paragraphs[0].text = elems[i]
            rows[i].cells[2].paragraphs[0].text = f"{str(quanti[i]*2)}" if (rrr and ("насос" in elems[i].lower())) else f"{str(quanti[i])}"
    for _ in range(1, len(table.rows) - len(elems)):
        remove_row(table, table.rows[-1])

    vector = vector.upper().replace('C','С') 
    doc.paragraphs[-2].add_run().add_picture(f"\\Scheme\\{'-'.join(vector.split('-')[1:3])}{'Р' if rrr else ''}.bmp", width=Mm(90))
    doc.paragraphs[-2].add_run().add_picture(f"\\Scheme\\legend.bmp", width=Mm(60)) # БЛЯ ЛОЛ################################################################################################################################
    doc.save(bio_doc)
    return doc


#compl_tab_with_table
def compl_tab_with_table(vector, doc, block, bio_doc, G, rezerv): # Наполняет таблицу комплектации из таблицы excel в шаблоне и сохраняет бланк
    from docx.shared import Mm
    print(G)
    rep_spi = valve_recognition(float(G), vector)
    elems, quanti = super_mega_giga(vector)
    #st.write(elems)
    #st.write(quanti)
    table = doc.tables[-2]
    rezez = rezerving(rezerv, vector)
    rrr = True
    if rezez is None:
        rrr = False
    else:
        elems.append(rezez[0][0])
        elems.append(rezez[1][0])
        quanti.append(rezez[0][1])
        quanti.append(rezez[1][1])
    print(elems)
    for ele in elems:
        if "клапан" in ele.lower():
            if "КССР" in ele or "КПСР" in ele or "Kvs" in ele:
                rval = ele

    ##################################################
    from docx.enum.text import WD_ALIGN_PARAGRAPH
    Data_frame = pd.read_excel(r'Scheme\ВЕКТОР_ТАБЛИЦА.xlsx')
    type_scheme = vector.split('-')
    type_scheme.pop(0)
    Number_Vector = f"{type_scheme[0]}-{type_scheme[1]}-{type_scheme[2]}"
    Number_Vector = Number_Vector.upper().replace('С','C')
    K_Number_Vector = f"К-{Number_Vector}"

    n = 0
    for i in range(1,13):
        values_equipment = Data_frame[Number_Vector].values[i-1]
        count_equipment =  Data_frame[K_Number_Vector].values[i-1]
        doc.tables[4].rows[i].cells[1].text = str(values_equipment)
        doc.tables[4].rows[i].cells[1].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        doc.tables[4].rows[i].cells[2].text = str(count_equipment)
        doc.tables[4].rows[i].cells[2].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        if values_equipment != '-':
            n +=1
    doc.tables[4].autofit
    
    if rezerv and type_scheme[1] != 'Ш':
        rez_list = rezerving(str(type_scheme[2]))
        #st.write(rez_list)
        values_equipment1 = rez_list[0][0]
        count_equipment1  = rez_list[0][1]
        values_equipment2 = rez_list[1][0]
        count_equipment2  = rez_list[1][1]
        doc.tables[4].rows[n+1].cells[1].text = str(values_equipment1)
        doc.tables[4].rows[n+1].cells[1].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        doc.tables[4].rows[n+1].cells[2].text = str(count_equipment1)
        doc.tables[4].rows[n+1].cells[2].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        doc.tables[4].rows[n+2].cells[1].text = str(values_equipment2)
        doc.tables[4].rows[n+2].cells[1].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        doc.tables[4].rows[n+2].cells[2].text = str(count_equipment2)
        doc.tables[4].rows[n+2].cells[2].paragraphs[0].alignment=WD_ALIGN_PARAGRAPH.CENTER
        n +=2

    def remove_row(table, row): # Просто удаляет пустые строки
        tbl, tr = table._tbl, row._tr
        tbl.remove(tr)

    for _ in range(20-n):
        remove_row(doc.tables[4], doc.tables[4].rows[-1])
    ##################################################
        

    vector = vector.upper().replace('C','С') 
    doc.paragraphs[-2].add_run().add_picture(f"C:\\Users\\kushhov\\Desktop\\vector\\Scheme\\{'-'.join(vector.split('-')[1:3])}{'Р' if rrr else ''}.bmp", width=Mm(90))
    doc.paragraphs[-2].add_run().add_picture(f"C:\\Users\\kushhov\\Desktop\\vector\\Scheme\\legend.bmp", width=Mm(60)) # БЛЯ ЛОЛ################################################################################################################################
    doc.save(bio_doc)
    return doc
